package com.dmdev.lesson4;

public class PrimitivnyeTipyDannyx {
    public static void main(String[] args) {

        /* целые числа
        byte - 1 байт (от -127 до +127)
        short - 2 байта (от -32.768 до +32.767)
        int - 4 байта (от - 2.147.483.648 до + 2.147.483.648)
        long - 8 байт (от - 9.223.372.036.854.775.808 до +9.223.372.036.854.775.807)
         */

        /* вещественные числа, числа с плавающей точкой 2,57
        float - 4 байта (3.40282347 * 10 в 38 степени)
        double - 8 байт (1.797........... * 10 в 308 степени)
         */

        /*символы
        char - от  0 до 65.536
         */

        /*логические значения
        boolean - true / false
         */
    }
}
